toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
    static void EventInsert(_Triggers::Event& ev, MSP::Repeat& repeat) {
        const Time::Ticks delta = _RepeatAdvance(repeat);
        // delta=0 means Repeat=never, in which case we don't reschedule the event
        if (delta) {
            EventInsert(ev, ev.time+delta);
        }
    }

    static void EventInsert(_Triggers::Event& ev, const Time::Instant& time, uint32_t deltaTicks) {
        EventInsert(ev, time + deltaTicks);
    }

    static void CaptureStart(_Triggers::CaptureImageEvent& ev, const Time::Instant& time) {
        // Reset capture count
        ev.countRem = ev.capture->count;
        if (ev.countRem) {
            EventInsert(ev, time);
        }
    }
    
    static void _EventTimerSchedule() {
        _Triggers::Event* ev = _Triggers::EventFront();
        if (ev) {
            _EventTimer::Schedule(ev->time);
        } else {
            _EventTimer::Reset();
        }
    }
    
    // _EventPop(): pops an event from the front of the list if it's ready to be handled
    // Interrupts must be disabled
    static _Triggers::Event& _EventPop() {
        _Triggers::Event* ev = _Triggers::EventFront();
        Assert(ev); // We must have an event at this point, or else we have a logic error
        _Triggers::EventPop();
        // Schedule _EventTimer for the next event
        _EventTimerSchedule();
        return *ev;
    }
    
    static bool _EventTimerFired() {
        const bool fired = _EventTimer::Fired();
        // Exit fast-forward mode the first time we have an event that's in the future
        if (!fired) _State.fastForward = false;
        return fired;
    }
    
    static void Run() {
        // Reset our state
        Reset();
        
        // Init SPI peripheral
        _SPI::Init();
        
        // Init Triggers
        _Triggers::Init(_RTC::Now());
        
        // Schedule _EventTimer for the first event
        _EventTimerSchedule();
        
        // Enter fast-forward mode while we pop every event that occurs in the past
        // (_EventTimerFired() will exit from fast-forward mode)
        #warning TODO: don't enter fast-forward mode if the first event is a relative time, otherwise we'll arbitrarily skip the first event in FF mode since it's in the past
        #warning TODO: OR: don't enter FF mode if our time is a relative time
        _State.fastForward = true;
        for (;;) {
            // Wait for _EventTimer to fire
            _Scheduler::Wait([] { return _EventTimerFired(); });
            _Triggers::Event& ev = _EventPop();
            
            // Don't go to sleep until we handle the event
            _State.caffeine = true;
            
            // Handle the event
            using T = _Triggers::Event::Type;
            switch (ev.type) {
            case T::TimeTrigger:      _TimeTrigger((_Triggers::TimeTriggerEvent&)ev);           break;
            case T::MotionEnable:     _MotionEnable((_Triggers::MotionEnableEvent&)ev);         break;
            case T::MotionDisable:    _MotionDisable((_Triggers::MotionDisableEvent&)ev);       break;
            case T::MotionUnsuppress: _MotionUnsuppress((_Triggers::MotionUnsuppressEvent&)ev); break;
            case T::CaptureImage:     _CaptureImage((_Triggers::CaptureImageEvent&)ev);         break;
            }
            
            // Allow sleep
            _State.caffeine = false;
        }
    }
    
    static inline struct __State {
        __State() {} // Compiler bug workaround
        // fastForward=true while initializing, where we execute events in 'fast-forward' mode,
        // solely to arrive at the correct state for the current time.
        // fastForward=false once we're done initializing and executing events normally.
        bool fastForward = false;
        // power / vddb / vddImgSd: our power assertions
        // These need to be ivars because _TaskEvent can be reset at any time via
        // our Reset() function, so if the power assertion lived on the stack and
        // _TaskEvent is reset, its destructor would never be called and our state
        // would be corrupted.
        _Caffeine::Assertion caffeine;
        _VDDBEnabled::Assertion vddb;
        _VDDIMGSDEnabled::Assertion vddImgSd;
    } _State;
    
    // Task stack
    SchedulerStack(".stack._TaskEvent")
    static inline uint8_t Stack[256];
};

static void _TaskEventRunningUpdate() {
    if (_Powered::Asserted() && !_HostMode::Asserted()) {
        _TaskEvent::Start();
    } else {
        _TaskEvent::Reset();
    }
}

// MARK: - _TaskI2C

struct _TaskI2C {
    static void Run() {
        for (;;) {
            // Wait until the I2C lines are activated (ie VDD_B_3V3_STM becomes powered)
            _I2C::WaitUntilActive();
            
            // Maintain power while I2C is active
            _Caffeine::Assertion caffeine(true);
            
            for (;;) {
                // Wait for a command
                MSP::Cmd cmd;
                bool ok = _I2C::Recv(cmd);
                if (!ok) break;
                
                // Handle command
                const MSP::Resp resp = _CmdHandle(cmd);
                
                // Send response
                ok = _I2C::Send(resp);
                if (!ok) break;
            }
            
            // Cleanup
            
//            // Relinquish LEDs, which may have been set by _CmdHandle()
            _LEDRed_.set(_LEDPriority::I2C, std::nullopt);
            _LEDGreen_.set(_LEDPriority::I2C, std::nullopt);
            
            // Reset state
            _State = {};
        }
    }
    
    static MSP::Resp _CmdHandle(const MSP::Cmd& cmd) {
        using namespace MSP;
        switch (cmd.op) {
        case Cmd::Op::None:
            return MSP::Resp{ .ok = false };
        
        case Cmd::Op::StateRead: {
            const size_t off = cmd.arg.StateRead.off;
            if (off > sizeof(::_State)) return MSP::Resp{ .ok = false };
            const size_t rem = sizeof(::_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Resp::arg.StateRead.data));
            MSP::Resp resp = { .ok = true };
            memcpy(resp.arg.StateRead.data, (uint8_t*)&::_State+off, len);
            return resp;
        }
        
        case Cmd::Op::StateWrite: {
            const size_t off = cmd.arg.StateWrite.off;
            if (off > sizeof(::_State)) return MSP::Resp{ .ok = false };
            FRAMWriteEn writeEn; // Enable FRAM writing
            const size_t rem = sizeof(::_State)-off;
            const size_t len = std::min(rem, sizeof(MSP::Cmd::arg.StateWrite.data));
            memcpy((uint8_t*)&::_State+off, cmd.arg.StateWrite.data, len);
            return MSP::Resp{ .ok = true };
        }
        
        case Cmd::Op::LEDSet:
            _LEDRed_.set(_LEDPriority::I2C, !cmd.arg.LEDSet.red);
            _LEDGreen_.set(_LEDPriority::I2C, !cmd.arg.LEDSet.green);
            return MSP::Resp{ .ok = true };
        
