toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        for (;;) {
            const _Button::Event ev = _Button::WaitForEvent();
            // Ignore all interaction in host mode
            if (_HostMode::Asserted()) continue;
            
            // Keep the lights on until we're done handling the event
            _Caffeine::Assertion caffeine(true);
            
            switch (ev) {
            case _Button::Event::Press: {
                // Ignore button presses if we're off
                if (!_On) break;
                
                for (auto it=_Triggers::ButtonTriggerBegin(); it!=_Triggers::ButtonTriggerEnd(); it++) {
                    _TaskEvent::CaptureStart(*it, _RTC::Now());
                }
                break;
            }
            
            case _Button::Event::Hold:
                _On = !_On;
                _OnSaved = _On;
                _LEDFlash(_On ? _LEDGreen_ : _LEDRed_);
                _Button::WaitForDeassert();
                break;
            }
        }
    }
    
    static void Sleep() {
        // Put ourself to sleep until an interrupt occurs. This function may or may not return:
        // 
        // - This function returns if an interrupt was already pending and the ISR
        //   wakes us (via `__bic_SR_register_on_exit`). In this case we never enter LPM3.5.
        // 
        // - This function doesn't return if an interrupt wasn't pending and
        //   therefore we enter LPM3.5. The next time we wake will be due to a
        //   reset and execution will start from main().
        
        // Enable/disable SysTick depending on whether we have tasks that are waiting for a deadline to pass.
        // We do this to prevent ourself from waking up unnecessarily, saving power.
        _SysTick = (bool)_Scheduler::WakeDeadline();
        
        // Remember our current interrupt state, which IntState will restore upon return
        Toastbox::IntState ints;
        // Atomically enable interrupts and go to sleep
        __bis_SR_register(GIE | LPM3_bits);
        
        // Re-enable SysTick upon wake
        _SysTick = true;
    }
    
    static void _LEDFlash(OutputPriority& led) {
        // Flash red LED to signal that we're turning off
        for (int i=0; i<5; i++) {
            led.set(_LEDPriority::Power, 0);
            _Scheduler::Delay(_Scheduler::Ms(50));
            led.set(_LEDPriority::Power, 1);
            _Scheduler::Delay(_Scheduler::Ms(50));
        }
        led.set(_LEDPriority::Power, std::nullopt);
    }
    
    // _On: controls user-visible on/off behavior
    static inline _Powered::Assertion _On;
    
    // _OnSaved: remembers our power state across crashes and LPM3.5.
    // This is needed because we don't want the device to return to the
    // powered-off state after a crash.
    // Stored in BAKMEM so it's kept alive through low-power modes <= LPM4.
    // gnu::used is apparently necessary for the gnu::section attribute to
    // work when link-time optimization is enabled.
    [[gnu::section(".ram_backup._TaskMain"), gnu::used]]
    static inline bool _OnSaved = false;
    
    // _SysTickEnabled: controls whether the SysTick timer is enabled
    // We disable SysTick when going to sleep if no tasks are waiting for a certain amount of time to pass
    static inline _SysTickEnabled::Assertion _SysTick;
    
    // Task stack
    static constexpr auto& Stack = _TaskMainStack;
};

// MARK: - IntState

inline bool Toastbox::IntState::Get() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::Set(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

// MARK: - Sleep

static void _Sleep() {
    _TaskMain::Sleep();
}

// MARK: - Interrupts

[[gnu::interrupt(RTC_VECTOR)]]
static void _ISR_RTC() {
    _RTC::ISR(RTCIV);
    if (_EventTimer::ISRRTCInterested()) {
        _EventTimer::ISRRTC();
        // Wake if the timer fired
        if (_EventTimer::Fired()) {
            __bic_SR_register_on_exit(LPM3_bits);
        }
    }
}

[[gnu::interrupt(TIMER0_A1_VECTOR)]]
static void _ISR_Timer0() {
    _EventTimer::ISRTimer0(TA0IV);
    // Wake if the timer fired
    if (_EventTimer::Fired()) {
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

[[gnu::interrupt(PORT2_VECTOR)]]
static void _ISR_Port2() {
    // Accessing `P2IV` automatically clears the highest-priority interrupt
    const uint16_t iv = P2IV;
    switch (__even_in_range(iv, 0x10)) {
    
    // Motion
    case _Pin::MOTION_SIGNAL::IVPort2():
        _Motion::ISR();
        __bic_SR_register_on_exit(LPM3_bits); // Wake ourself
        break;
    
    // I2C (ie VDD_B_3V3_STM)
    case _I2C::Pin::Active::IVPort2():
        _I2C::ISR_Active(iv);
        __bic_SR_register_on_exit(LPM3_bits); // Wake ourself
        break;
    
    // Button
    case _Button::Pin::IVPort2():
        _Button::ISR();
        __bic_SR_register_on_exit(LPM3_bits); // Wake ourself
        break;
    
    default:
        break;
    }
}

[[gnu::interrupt(USCI_B0_VECTOR)]]
static void _ISR_USCI_B0() {
    // Accessing `UCB0IV` automatically clears the highest-priority interrupt
    const uint16_t iv = UCB0IV;
    _I2C::ISR_I2C(iv);
    // Wake ourself
    __bic_SR_register_on_exit(LPM0_bits);
}

[[gnu::interrupt(WDT_VECTOR)]]
static void _ISR_SysTick() {
    const bool wake = _Scheduler::Tick();
    if (wake) {
        // Wake ourself
        __bic_SR_register_on_exit(LPM3_bits);
    }
}

[[gnu::interrupt(ADC_VECTOR)]]
static void _ISR_ADC() {
    _BatterySampler::ISR(ADCIV);
    // Wake ourself
    __bic_SR_register_on_exit(LPM3_bits);
}

[[gnu::interrupt(UNMI_VECTOR)]]
static void _ISR_UNMI() {
    const uint16_t iv = SYSUNIV;
    
    switch (__even_in_range(iv, SYSUNIV_OFIFG)) {
    
    case SYSUNIV_NMIIFG:
        Assert(false);
        break;
    
    case SYSUNIV_OFIFG:
        Assert(false);
        break;
    
    default:
        Assert(false);
        break;
    }
}

// MARK: - Abort

[[noreturn]]
static void _SchedulerStackOverflow() {
    Assert(false);
}

static void _AbortRecord(const Time::Instant& timestamp, uintptr_t addr) {
    using namespace MSP;
    FRAMWriteEn writeEn; // Enable FRAM writing
    
    AbortHistory* hist = nullptr;
    for (AbortHistory& h : _State.aborts) {
        if (!h.count || h.addr==addr) {
            hist = &h;
            break;
        }
    }
    
    // If we don't have a place to record the abort, bail
    if (!hist) return;
    
    // Prep the element if this is the first instance
    if (!hist->count) {
        hist->addr = addr;
        hist->earliest = timestamp;
    }
    
    hist->latest = timestamp;
    hist->count++;
}

[[noreturn]]
static void _BOR() {
    PMMUnlock pmm; // Unlock PMM registers
    PMMCTL0_L |= PMMSWBOR_L;
    // Wait for reset
    for (;;);
}

// Abort(): called by Assert() with the address that aborted
extern "C"
[[noreturn, gnu::used]]
void Abort(uintptr_t addr) {
    const Time::Instant timestamp = _RTC::Now();
    // Record the abort
    _AbortRecord(timestamp, addr);
    _BOR();
}

extern "C"
[[noreturn]]
void abort() {
    Assert(false);
}

extern "C"
int atexit(void (*)(void)) {
    return 0;
}

// MARK: - Main

//extern "C" void Blink() {
//    for (;;) {
//        _Pin::LED_GREEN_::Write(0);
//        for (volatile uint16_t i=0; i<50000; i++);
//        _Pin::LED_GREEN_::Write(1);
//        for (volatile uint16_t i=0; i<50000; i++);
//    }
//}

int main() {
    // Invokes the first task's Run() function (_TaskMain::Run)
    _Scheduler::Run();
}
